#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Experimental feature "module_variable_optional_attrs" is active

  on main.tf line 19, in terraform:
  19:   experiments      = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖`success`
#### Checkov 🧪`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.prefix[0] will be created
  + resource "random_string" "prefix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = (known after apply)
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.automation.azurerm_cosmosdb_account.acct["automation"] will be created
  + resource "azurerm_cosmosdb_account" "acct" {
      + access_key_metadata_writes_enabled    = true
      + analytical_storage_enabled            = false
      + connection_strings                    = (sensitive value)
      + create_mode                           = (known after apply)
      + default_identity_type                 = "FirstPartyIdentity"
      + enable_automatic_failover             = false
      + enable_free_tier                      = false
      + enable_multiple_write_locations       = false
      + endpoint                              = (known after apply)
      + id                                    = (known after apply)
      + is_virtual_network_filter_enabled     = false
      + kind                                  = "GlobalDocumentDB"
      + local_authentication_disabled         = false
      + location                              = "southcentralus"
      + mongo_server_version                  = (known after apply)
      + name                                  = (known after apply)
      + network_acl_bypass_for_azure_services = false
      + offer_type                            = "Standard"
      + primary_key                           = (sensitive value)
      + primary_readonly_key                  = (sensitive value)
      + public_network_access_enabled         = false
      + read_endpoints                        = (known after apply)
      + resource_group_name                   = (known after apply)
      + secondary_key                         = (sensitive value)
      + secondary_readonly_key                = (sensitive value)
      + tags                                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + write_endpoints                       = (known after apply)

      + analytical_storage {
          + schema_type = (known after apply)
        }

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + type                = (known after apply)
        }

      + capabilities {
          + name = (known after apply)
        }

      + capacity {
          + total_throughput_limit = (known after apply)
        }

      + consistency_policy {
          + consistency_level       = "Session"
          + max_interval_in_seconds = (known after apply)
          + max_staleness_prefix    = (known after apply)
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "southcentralus"
          + zone_redundant    = false
        }
    }

  # module.automation.azurerm_cosmosdb_sql_database.db["automation"] will be created
  + resource "azurerm_cosmosdb_sql_database" "db" {
      + account_name        = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + throughput          = 400
    }

  # module.consumption.azurerm_container_registry.acr["acr1"] will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "southcentralus"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = false
      + quarantine_policy_enabled     = true
      + resource_group_name           = (known after apply)
      + retention_policy              = [
          + {
              + days    = 7
              + enabled = true
            },
        ]
      + sku                           = "Premium"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.consumption.azurerm_shared_image_gallery.sig["gallery1"] will be created
  + resource "azurerm_shared_image_gallery" "sig" {
      + description         = "This is a shared image gallery"
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + tags                = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + unique_name         = (known after apply)
    }

  # module.consumption.azurerm_synapse_private_link_hub.plh["plh1"] will be created
  + resource "azurerm_synapse_private_link_hub" "plh" {
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.adf.azure.com"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.api.azureml.ms"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.azurecr.io"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.azuresynapse.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.blob.core.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.cognitiveservices.azure.com"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.database.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.datafactory.azure.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.dev.azuresynapse.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.dfs.core.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.documents.azure.com"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.file.core.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.notebooks.azure.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.purview.azure.com"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.purviewstudio.azure.com"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.queue.core.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.search.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.servicebus.windows.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.sql.azuresynapse.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.remote_vnet_links["privatelink.vaultcore.azure.net"] will be created
  + resource "azapi_resource" "remote_vnet_links" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.virtualNetworkPeerings["dmlz_to_hub"] will be created
  + resource "azapi_resource" "virtualNetworkPeerings" {
      + body                      = jsonencode(
            {
              + properties = {
                  + allowForwardedTraffic     = true
                  + allowGatewayTransit       = false
                  + allowVirtualNetworkAccess = true
                  + doNotVerifyRemoteGateways = false
                  + remoteVirtualNetwork      = {
                      + id = "/subscriptions/893395a4-65a3-4525-99ea-2378c6e0dbed/resourceGroups/rg-network_connectivity_hub/providers/Microsoft.Network/virtualNetworks/vnet-connectivity_hub"
                    }
                  + useRemoteGateways         = true
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Network/virtualNetworks/virtualNetworkPeerings@2021-05-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azapi_resource.virtualNetworkPeerings["hub_to_dmlz"] will be created
  + resource "azapi_resource" "virtualNetworkPeerings" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/893395a4-65a3-4525-99ea-2378c6e0dbed/resourceGroups/rg-network_connectivity_hub/providers/Microsoft.Network/virtualNetworks/vnet-connectivity_hub"
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Network/virtualNetworks/virtualNetworkPeerings@2021-05-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.azurerm_network_security_group.nsg["empty_nsg"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
      + tags                = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["automation"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["consumption"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["governance"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["integration"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["logmon"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["management"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["marketplace"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["meshservices"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["network"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_resource_group.rg["sharedservices"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southcentralus"
      + name     = (known after apply)
      + tags     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.core.azurerm_subnet.snet["data_gateway"] will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.11.2.128/25",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)

      + delegation {
          + name = "power-platform-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.PowerPlatform/vnetaccesslinks"
            }
        }
    }

  # module.core.azurerm_subnet.snet["private_endpoints"] will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.11.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.core.azurerm_subnet.snet["services"] will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.11.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.core.azurerm_subnet.ssnet["fw_subnet"] will be created
  + resource "azurerm_subnet" "ssnet" {
      + address_prefixes                               = [
          + "10.11.2.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.core.azurerm_subnet.ssnet["gw_subnet"] will be created
  + resource "azurerm_subnet" "ssnet" {
      + address_prefixes                               = [
          + "10.11.2.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # module.core.azurerm_subnet_network_security_group_association.nsg_assoc["data_gateway"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core.azurerm_subnet_network_security_group_association.nsg_assoc["private_endpoints"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core.azurerm_subnet_network_security_group_association.nsg_assoc["services"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core.azurerm_virtual_network.vnet["vnet"] will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.11.0.0/21",
        ]
      + dns_servers         = [
          + "10.11.2.68",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.governance.azurerm_purview_account.pva["pva1"] will be created
  + resource "azurerm_purview_account" "pva" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "southcentralus"
      + managed_resource_group_name                      = "managed-purview"
      + managed_resources                                = (known after apply)
      + name                                             = (known after apply)
      + public_network_enabled                           = false
      + resource_group_name                              = (known after apply)
      + scan_endpoint                                    = (known after apply)
      + tags                                             = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.governance.azurerm_role_assignment.role_assignment["pv_kv"] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.integration.azurerm_role_assignment.role_assignment["kvint"] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad82215-068b-4f31-8a4c-84a6333b6df8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.integration.time_sleep.shirdelay will be created
  + resource "time_sleep" "shirdelay" {
      + create_duration = "25s"
      + id              = (known after apply)
    }

  # module.automation.module.private_endpoints["cosmos"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "cosmos"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "Sql",
            ]
        }
    }

  # module.consumption.module.diagnostics["acr1"].azurerm_monitor_diagnostic_setting.diagnostics["operations"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "acr_logs"
      + target_resource_id             = (known after apply)

      + log {
          + category = "ContainerRegistryLoginEvents"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "ContainerRegistryRepositoryEvents"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
    }

  # module.consumption.module.private_endpoints["acr"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.azurecr.io"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "acr0031"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.consumption.module.private_endpoints["plhpe1"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "syn-plh"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "web",
            ]
        }
    }

  # module.core.module.azure_firewall["fw01"].azurerm_firewall.fw will be created
  + resource "azurerm_firewall" "fw" {
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "southcentralus"
      + name                = "dmlz-firewall"
      + resource_group_name = (known after apply)
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Premium"
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "public-ip"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.core.module.azure_firewall["fw01"].azurerm_firewall_policy.fw_policy will be created
  + resource "azurerm_firewall_policy" "fw_policy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + resource_group_name      = (known after apply)
      + rule_collection_groups   = (known after apply)
      + sku                      = "Premium"
      + threat_intelligence_mode = "Deny"

      + dns {
          + proxy_enabled = true
        }

      + intrusion_detection {
          + mode = "Deny"
        }
    }

  # module.core.module.azure_firewall["fw01"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southcentralus"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.core.module.azure_firewall["fw01"].time_sleep.after_azurerm_firewall_policies will be created
  + resource "time_sleep" "after_azurerm_firewall_policies" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_solution.solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "solution" {
      + id                    = (known after apply)
      + location              = "southcentralus"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + tags                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.core.module.diagnostic_log_analytics["central_logs_region1"].azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = "southcentralus"
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = (known after apply)
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + workspace_id                       = (known after apply)
    }

  # module.core.module.subscription_diagnostics.azurerm_monitor_diagnostic_setting.diagnostics["subscription_diag"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "subscription_operations"
      + target_resource_id         = "/subscriptions/47f7e6d7-0e52-4394-92cb-5f106bbc647f"

      + log {
          + category = "Administrative"
          + enabled  = true
        }
      + log {
          + category = "Alert"
          + enabled  = true
        }
      + log {
          + category = "Autoscale"
          + enabled  = true
        }
      + log {
          + category = "Policy"
          + enabled  = true
        }
      + log {
          + category = "Recommendation"
          + enabled  = true
        }
      + log {
          + category = "ResourceHealth"
          + enabled  = true
        }
      + log {
          + category = "Security"
          + enabled  = true
        }
      + log {
          + category = "ServiceHealth"
          + enabled  = true
        }
    }

  # module.governance.module.keyvault["governance"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "southcentralus"
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = (known after apply)
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + tenant_id                       = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + timeouts {
          + delete = "60m"
        }
    }

  # module.governance.module.private_endpoints["account"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "account"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.governance.module.private_endpoints["blob"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "blob"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.governance.module.private_endpoints["eventhub"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "eventhub"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # module.governance.module.private_endpoints["portal"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "portal"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # module.governance.module.private_endpoints["queue"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "queue"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.integration.module.data_factory["df1"].azurerm_data_factory.df will be created
  + resource "azurerm_data_factory" "df" {
      + id                              = (known after apply)
      + location                        = "southcentralus"
      + managed_virtual_network_enabled = true
      + name                            = (known after apply)
      + public_network_enabled          = false
      + resource_group_name             = (known after apply)
      + tags                            = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.integration.module.keyvault["integration"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "southcentralus"
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = (known after apply)
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + tenant_id                       = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + timeouts {
          + delete = "60m"
        }
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_key_vault_secret.admin_password["windows"] will be created
  + resource "azurerm_key_vault_secret" "admin_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_lb.lb will be created
  + resource "azurerm_lb" "lb" {
      + id                   = (known after apply)
      + location             = "southcentralus"
      + name                 = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = (known after apply)
      + sku                  = "Basic"
      + sku_tier             = "Regional"
      + tags                 = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "feipconfig"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = (known after apply)
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_lb_backend_address_pool.backend_address_pool will be created
  + resource "azurerm_lb_backend_address_pool" "backend_address_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "shir-backend-pool"
      + outbound_rules            = (known after apply)
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_lb_probe.lb_probe will be created
  + resource "azurerm_lb_probe" "lb_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = (known after apply)
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_lb_rule.lb_rule will be created
  + resource "azurerm_lb_rule" "lb_rule" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "feipconfig"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "rule1"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southcentralus"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].azurerm_windows_virtual_machine_scale_set.vmss["windows"] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "adminuser"
      + computer_name_prefix                              = "shir00"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + eviction_policy                                   = "Deallocate"
      + extensions_time_budget                            = "PT1H30M"
      + health_probe_id                                   = (known after apply)
      + id                                                = (known after apply)
      + instances                                         = 2
      + location                                          = "southcentralus"
      + max_bid_price                                     = -1
      + name                                              = "shir00"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Spot"
      + provision_vm_agent                                = true
      + resource_group_name                               = (known after apply)
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = true
      + sku                                               = "Standard_D4d_v4"
      + tags                                              = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + zone_balance                                      = false

      + automatic_instance_repair {
          + enabled      = true
          + grace_period = "PT30M"
        }

      + automatic_os_upgrade_policy {
          + disable_automatic_rollback  = false
          + enable_automatic_os_upgrade = false
        }

      + extension {
          + auto_upgrade_minor_version = true
          + name                       = "custom_script"
          + protected_settings         = (sensitive value)
          + provision_after_extensions = []
          + publisher                  = "Microsoft.Compute"
          + settings                   = jsonencode(
                {
                  + fileUris = [
                      + "https://raw.githubusercontent.com/Azure/data-landing-zone/main/code/installSHIRGateway.ps1",
                    ]
                }
            )
          + type                       = "CustomScriptExtension"
          + type_handler_version       = "1.10"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = (known after apply)
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + name                                   = (known after apply)
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + rolling_upgrade_policy {
          + max_batch_instance_percent              = 60
          + max_unhealthy_instance_percent          = 60
          + max_unhealthy_upgraded_instance_percent = 60
          + pause_time_between_batches              = "PT01M"
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.integration.module.vmss_self_hosted_integration_runtime["vmss01"].random_password.admin["windows"] will be created
  + resource "random_password" "admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 123
      + lower            = true
      + min_lower        = 2
      + min_numeric      = 0
      + min_special      = 2
      + min_upper        = 2
      + number           = true
      + numeric          = true
      + override_special = "!@#$%&"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.core.module.azure_firewall["fw01"].module.fw_policy_rules.azurerm_firewall_policy_rule_collection_group.fw_application_rules_collection will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "fw_application_rules_collection" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-pol-application-rules-collection"
      + priority           = 20000

      + application_rule_collection {
          + action   = "Allow"
          + name     = "MachineLearning-ApplicationRules"
          + priority = 20100

          + rule {
              + destination_fqdns = [
                  + "anaconda.com",
                  + "*.anaconda.com",
                  + "*.anaconda.org",
                  + "pypi.org",
                  + "cloud.r-project.org",
                  + "*pytorch.org",
                  + "*.tensorflow.org",
                  + "*.instances.azureml.net",
                  + "*.instances.azureml.ms",
                ]
              + name              = "MachineLearning-ApplicationRule-001"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "HDInsight-ApplicationRules"
          + priority = 20200

          + rule {
              + destination_fqdn_tags = [
                  + "HDInsight",
                  + "WindowsUpdate",
                ]
              + name                  = "HDInsight-ApplicationRule-001"
              + source_addresses      = [
                  + "*",
                ]
              + terminate_tls         = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "login.microsoftonline.com",
                  + "login.windows.net",
                ]
              + name              = "HDInsight-ApplicationRule-002"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "DataFactory-ApplicationRules"
          + priority = 20300

          + rule {
              + destination_fqdns = [
                  + "go.microsoft.com",
                  + "download.microsoft.com",
                  + "browser.events.data.msn.com",
                  + "*.clouddatahub.net",
                ]
              + name              = "DataFactory-ApplicationRule-001"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.servicebus.windows.net",
                ]
              + name              = "DataFactory-ApplicationRule-002"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.githubusercontent.com",
                ]
              + name              = "DataFactory-ApplicationRule-003"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "Databricks-ApplicationRules"
          + priority = 20400

          + rule {
              + destination_fqdns = [
                  + "tunnel.australiaeast.azuredatabricks.net",
                  + "tunnel.brazilsouth.azuredatabricks.net",
                  + "tunnel.canadacentral.azuredatabricks.net",
                  + "tunnel.centralindia.azuredatabricks.net",
                  + "tunnel.eastus2.azuredatabricks.net",
                  + "tunnel.eastus2c2.azuredatabricks.net",
                  + "tunnel.eastusc3.azuredatabricks.net",
                  + "tunnel.centralusc2.azuredatabricks.net",
                  + "tunnel.northcentralusc2.azuredatabricks.net",
                  + "tunnel.southeastasia.azuredatabricks.net",
                  + "tunnel.francecentral.azuredatabricks.net",
                  + "tunnel.japaneast.azuredatabricks.net",
                  + "tunnel.koreacentral.azuredatabricks.net",
                  + "tunnel.northeuropec2.azuredatabricks.net",
                  + "tunnel.westus.azuredatabricks.net",
                  + "tunnel.westeurope.azuredatabricks.net",
                  + "tunnel.westeuropec2.azuredatabricks.net",
                  + "tunnel.southafricanorth.azuredatabricks.net",
                  + "tunnel.switzerlandnorth.azuredatabricks.net",
                  + "tunnel.uaenorth.azuredatabricks.net",
                  + "tunnel.ukwest.azuredatabricks.net",
                ]
              + name              = "Databricks-ApplicationRule-001"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "archive.ubuntu.com",
                  + "github.com",
                  + "*.maven.apache.org",
                  + "conjars.org",
                ]
              + name              = "Databricks-ApplicationRule-002"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "Azure-ApplicationRules"
          + priority = 20500

          + rule {
              + destination_fqdns = [
                  + "*microsoft.com",
                  + "*azure.com",
                  + "*windows.com",
                  + "*windows.net",
                  + "*azure-automation.net",
                  + "*digicert.com",
                ]
              + name              = "Azure-ApplicationRule-001"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "archive.ubuntu.com",
                  + "github.com",
                  + "*.maven.apache.org",
                  + "conjars.org",
                ]
              + name              = "Databricks-ApplicationRule-002"
              + source_addresses  = [
                  + "*",
                ]
              + terminate_tls     = false

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
    }

  # module.core.module.azure_firewall["fw01"].module.fw_policy_rules.azurerm_firewall_policy_rule_collection_group.fw_network_rules_collection will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "fw_network_rules_collection" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-pol-network-rules-collection"
      + priority           = 10000

      + network_rule_collection {
          + action   = "Allow"
          + name     = "MachineLearning-NetworkRules"
          + priority = 10100

          + rule {
              + destination_addresses = [
                  + "AzureActiveDirectory",
                  + "AzureMachineLearning",
                  + "AzureResourceManager",
                  + "Storage",
                  + "AzureKeyVault",
                  + "AzureContainerRegistry",
                  + "MicrosoftContainerRegistry",
                  + "AzureFrontDoor.FirstParty",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "MachineLearning-NetworkRule-001"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "HDInsight-NetworkRules"
          + priority = 10200

          + rule {
              + destination_addresses = [
                  + "Sql",
                ]
              + destination_ports     = [
                  + "1433",
                ]
              + name                  = "HDInsight-NetworkRule-001"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "AzureMonitor",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "HDInsight-NetworkRule-002"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "Databricks-NetworkRules"
          + priority = 10300

          + rule {
              + destination_addresses = [
                  + "AzureActiveDirectory",
                  + "AzureFrontDoor.Frontend",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "Databricks-NetworkRule-001"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "AzureDatabricks",
                  + "Storage",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "Databricks-NetworkRule-002"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "Sql",
                ]
              + destination_ports     = [
                  + "3306",
                ]
              + name                  = "Databricks-NetworkRule-003"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "EventHub",
                ]
              + destination_ports     = [
                  + "9093",
                ]
              + name                  = "Databricks-NetworkRule-004"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "Azure-NetworkRules"
          + priority = 10400

          + rule {
              + destination_addresses = [
                  + "23.102.135.246",
                  + "51.4.143.248",
                  + "23.97.0.13",
                  + "42.159.7.249",
                ]
              + destination_ports     = [
                  + "1688",
                ]
              + name                  = "Azure-NetworkRule-001"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "AzureMonitor",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "HDInsight-NetworkRule-002"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
    }

  # module.core.module.private_dns["vnet"].module.dns_zone_vnet_links["privatelink.mongo.cosmos.azure.com"].azapi_resource.virtualNetworkLinks will be created
  + resource "azapi_resource" "virtualNetworkLinks" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = false
      + location                  = "global"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + tags                      = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }
      + type                      = "Microsoft.Network/privateDnsZones/virtualNetworkLinks@2020-06-01"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.core.module.private_dns["vnet"].module.zones["privatelink.mongo.cosmos.azure.com"].azurerm_private_dns_zone.private_dns_zone will be created
  + resource "azurerm_private_dns_zone" "private_dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.mongo.cosmos.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = (known after apply)
      + tags                                                  = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.governance.module.keyvault["governance"].module.diagnostics.azurerm_monitor_diagnostic_setting.diagnostics["central_logs_region1"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = (known after apply)
      + target_resource_id             = (known after apply)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
    }

  # module.governance.module.keyvault["governance"].module.private_endpoint["vault"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvgov"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.integration.module.data_factory["df1"].module.diagnostics.azurerm_monitor_diagnostic_setting.diagnostics["central_logs_region1"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = (known after apply)
      + target_resource_id             = (known after apply)

      + log {
          + category = "ActivityRuns"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "PipelineRuns"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISIntegrationRuntimeLogs"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISPackageEventMessageContext"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISPackageEventMessages"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISPackageExecutableStatistics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISPackageExecutionComponentPhases"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SSISPackageExecutionDataStatistics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SandboxActivityRuns"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "SandboxPipelineRuns"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "TriggerRuns"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
    }

  # module.integration.module.data_factory["df1"].module.private_endpoint["df1-factory"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.datafactory.azure.net"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "adf-int-acct"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dataFactory",
            ]
        }
    }

  # module.integration.module.data_factory["df1"].module.private_endpoint["df1-portal"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.adf.azure.com"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "adf-int-portal"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # module.integration.module.data_factory["df1"].module.self_hosted_integration_runtimes["dfirsh1"].azurerm_data_factory_integration_runtime_self_hosted.shir will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "shir" {
      + data_factory_id             = (known after apply)
      + id                          = (known after apply)
      + name                        = (known after apply)
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.integration.module.keyvault["integration"].module.diagnostics.azurerm_monitor_diagnostic_setting.diagnostics["central_logs_region1"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = (known after apply)
      + target_resource_id             = (known after apply)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
    }

  # module.integration.module.keyvault["integration"].module.private_endpoint["vault"].azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "southcentralus"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Org"      = "Cloud Ops"
          + "Project"  = "Data Management Landing Zone"
          + "Solution" = "CAF Cloud Scale Analytics"
          + "Toolkit"  = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvint"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

Plan: 97 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dlz_params      = {
      + azure_firewall_ip_address              = "10.11.2.68"
      + connectivity_hub_vnet_id               = "/subscriptions/893395a4-65a3-4525-99ea-2378c6e0dbed/resourceGroups/rg-network_connectivity_hub/providers/Microsoft.Network/virtualNetworks/vnet-connectivity_hub"
      + create_connectivity_hub_peerings       = true
      + deploy_azure_firewall                  = true
      + deploy_dmlz_shared_integration_runtime = true
      + log_analytics_workspace_resource_id    = (known after apply)
      + log_analytics_workspace_workspace_id   = (known after apply)
      + mgmt_zone_factory_id                   = (known after apply)
      + mgmt_zone_shir_id                      = (known after apply)
      + mgmt_zone_vnet_cidr                    = [
          + "10.11.0.0/21",
        ]
      + mgmt_zone_vnet_id                      = (known after apply)
      + private_dns_zones                      = {
          + "privatelink.adf.azure.com"               = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com"
          + "privatelink.api.azureml.ms"              = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
          + "privatelink.azurecr.io"                  = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
          + "privatelink.azuresynapse.net"            = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
          + "privatelink.blob.core.windows.net"       = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
          + "privatelink.cognitiveservices.azure.com" = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com"
          + "privatelink.database.windows.net"        = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net"
          + "privatelink.datafactory.azure.net"       = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net"
          + "privatelink.dev.azuresynapse.net"        = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net"
          + "privatelink.dfs.core.windows.net"        = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net"
          + "privatelink.documents.azure.com"         = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
          + "privatelink.file.core.windows.net"       = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
          + "privatelink.mongo.cosmos.azure.com"      = (known after apply)
          + "privatelink.notebooks.azure.net"         = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
          + "privatelink.purview.azure.com"           = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
          + "privatelink.purviewstudio.azure.com"     = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com"
          + "privatelink.queue.core.windows.net"      = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
          + "privatelink.search.windows.net"          = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net"
          + "privatelink.servicebus.windows.net"      = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
          + "privatelink.sql.azuresynapse.net"        = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
          + "privatelink.vaultcore.azure.net"         = "/subscriptions/c00669a2-37e9-4e0d-8b57-4e8dd0fcdd4a/resourceGroups/rg-scus-pe-lab-network/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
        }
    }
  + global_settings = {
      + client_config = {
          + client_id               = "42069eb9-858a-47c5-9d51-9e1f9882dc8b"
          + logged_aad_app_objectId = null
          + logged_user_objectId    = null
          + object_id               = "dad82215-068b-4f31-8a4c-84a6333b6df8"
          + subscription_id         = "/subscriptions/47f7e6d7-0e52-4394-92cb-5f106bbc647f"
          + tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
        }
      + environment   = "dev"
      + location      = "southcentralus"
      + name          = (known after apply)
      + name_clean    = (known after apply)
      + prefix        = (known after apply)
      + tags          = {
          + Org      = "Cloud Ops"
          + Project  = "Data Management Landing Zone"
          + Solution = "CAF Cloud Scale Analytics"
          + Toolkit  = "Terraform"
        }
    }

Warning: Experimental feature "module_variable_optional_attrs" is active

  on main.tf line 19, in terraform:
  19:   experiments      = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

<details><summary>Show Checkov Results</summary>

| check_id   | file   | resource   | check_name   | guideline   |
|------------|--------|------------|--------------|-------------|

---

</details>

*Pusher: @tschwarz01, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*